app/controllers/admin/categories_controller.rb

	def create
		@category = Category.new(params[:category])
		@category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Tue, 04 Dec 2012 13:50:21 UTC +00:00], ["name", "Chomiki"], ["updated_at", Tue, 04 Dec 2012 13:50:21 UTC +00:00]]

 	def update
		@category = Category.find(params[:id])
		if @category.update_attributes(params[:category])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", "7"]]
UPDATE "categories" SET "name" = 'Chomiczki', "updated_at" = '2012-12-04 13:50:35.660131' WHERE "categories"."id" = 7