app/controllers/admin/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."completed" = 'true'
---
	def index
		@orders = Order.where(:completed => 'true')