app/controllers/admin/products_controller.rb

INSERT INTO "products" ("category_id", "created_at", "description", "name", "price", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["category_id", nil], ["created_at", Tue, 04 Dec 2012 12:29:25 UTC +00:00], ["description", ""], ["name", "New product"], ["price", 0], ["updated_at", Tue, 04 Dec 2012 12:29:25 UTC +00:00]]
---
	def new
		@product = Product.create({:name => "New product", :description => "", :price => 0})

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", "2007"]]
SELECT "categories".* FROM "categories"
---
	def edit
		@product = Product.find(params[:id])
		@categories = Category.all

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "products" SET "description" = 'mmmmmm mniam mm', "updated_at" = '2012-12-04 15:17:23.898025' WHERE "products"."id" = 2
---
	def update
		@product = Product.find(params[:id])
		if @product.update_attributes(params[:product])