app/views/admin/orders/index.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 2
---
		<td>
			<% order.order_items.each do |order_item| %>