app/views/shop/index.html.erb

<h4>Wyszukiwarka:</h4>
	<%= search_form_for Product.search(params[:q]), :url=>search_results_path do |f| %>
---
SELECT "products".* FROM "products"

		</tr>
		<% @current_cart.order_items.each do |order_item| %>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 4