app/controllers/order_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."product_id" = 1 AND "order_items"."order_id" = 2 LIMIT 1
INSERT INTO "order_items" ("created_at", "order_id", "price", "product_id", "quantity", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Mon, 03 Dec 2012 12:27:49 UTC +00:00], ["order_id", 2], ["price", nil], ["product_id", 1], ["quantity", 1], ["updated_at", Mon, 03 Dec 2012 12:27:49 UTC +00:00]]
UPDATE "order_items" SET "quantity" = 2, "updated_at" = '2012-12-03 12:27:59.243564' WHERE "order_items"."id" = 1
---
 	def add
		@product = Product.find(params[:id])
		@order_item = OrderItem.where(:product_id => @product.id, :order_id => @current_cart.id).first
		if @order_item == nil
			@order_item = OrderItem.create(:product_id => @product.id, :order_id => @current_cart.id,:quantity => 1)
		else
			@order_item.quantity += 1
			@order_item.save

SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT 1  [["id", "5"]]
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 5]]
---
	def delete
		@orderitem = OrderItem.find(params[:id])
		@orderitem.destroy

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = 2
UPDATE "orders" SET "completed" = 't', "updated_at" = '2012-12-03 12:28:49.488438' WHERE "orders"."id" = 2
INSERT INTO "orders" ("buyer_id", "completed", "created_at", "ordered", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["buyer_id", 18], ["completed", false], ["created_at", Mon, 03 Dec 2012 12:28:49 UTC +00:00], ["ordered", nil], ["updated_at", Mon, 03 Dec 2012 12:28:49 UTC +00:00]]
---
	def checkout
		@order = Order.find(@current_cart.id)
		if @order.order_items.empty?
			flash[:notice] = 'Empty cart'
			redirect_to :back
		else
			@order.completed = true
			@order.save
			@current_cart = Order.create(:buyer_id => @current_buyer.id,:completed => 'false')