app/controllers/search_controller.rb

	def results
		@categories = Category.all
---
SELECT "categories".* FROM "categories"