app/controllers/shop_controller.rb

SELECT "products".* FROM "products"
SELECT "categories".* FROM "categories"
---
	def index
		@products = Product.all
		@categories = Category.all